//js_06_for.js

//while
//------------------------------------------
// 변수를 먼저 선언 
//while(조건의 비교){ 기능.... 변수값의 변화}
//-------------------------------------------
/*
var i = 0;// 변수선언
while(i < 10){//조건비교
 
 console.log(i);

i += 1; //변수의 변화   
}

*/

// do~while
// 최초의 변수선언
// do {
//     기능수행
//     변수의 변화
// } while (조건비교)
//------------------------

/*
var i = 100;
do{
   console.log(i);
   i+=1;

} while (i < 10) */

//===========================
//for
//최초의 변수값
//for(;조건비교;){ 기능 ....  변수의 변화}
//------------------------------------------------
// for(최초변수값; 조건비교; 변수의 변화 ) {기능...}
//------------------------------------------------
//

/*
var i = 0;
for(; i < 10 ; ){


console.log(i);

 i += 1;
}
*/
/*
for(var i = 0; i < 10; i+=1){
  console.log(i);

}
console.log('i가 바깥에서 나올까?', i);
*/

var i = 0;
for(; i < 10; i+=1){
  console.log(i);

}
console.log('i가 바깥에서 나올까?', i);

